#print() ფუნქციას ჩვენ ვიყენებთ ინფორმაციის ტერმინალში გამოტანისთვის.
#type() ფუნქცია გვიჩვენებს თუ რა ტიპის მონაცემია ჩაწერილი ანუ მაგალითად string,integer,float...
#for() ფუნქცია 1მნის ციკლს გარკვეული რიცხვიდან ან მონაცემიდან გარკვეულ სასრულ რიცხვამდე/მონაცემამდე.
#str() გარდაქმნის მონაცემს string-ად.
#int() გარდაქმნის მონაცემს რიცხვისებურ მონაცემად.
#bool() გარდაქმნის მონაცემს boolean- ად.
#flo() გარდაქმნის მონაცემს წილადად.

#.upper მეთოდს გადაჰყავს string-ის ყველა ასო დიდ ასოებად.
#.lower მეთოდს გადაჰყავს string-is ყველა ასო პატარა ასოებად.
#.capitalize მეთოდის გამოყენებისას string-ის პირველი ასო დიდია.
#.find მეთოდი ეძებს string-ის მონაცემთა შორის მითითებულ სიმბოლოს და შემდეგ აგდებს მის ინდექსს.

result = 0

for num in range(0, 31, 2):
    print(num)
    result += 1

print("ციკლი გამეორების რაოდენობა", result)

#არგუმენტები — ეს არის მონაცემები რომლებიც ფუნქციაში გადადის.
print(
    "ტექსტი",          # str
    10,                # int
    3.14,              # float
    True,              # bool
)


lastname = "bedoshvili"
print(lastname[::-1])
first_four = lastname[0:4]
print(first_four)
