# > - მეტობა
# < - ნაკლებობა
# >= - მეტია ან ტოლი.
# <= - ნაკლებია ან ტოლი
# == - უდრის თუ არა პირველი მონაცემი

print(10 > 9)
print(120 > 70)
print(69 > 42)
print(212 > 90)
print(77 > 11)

print(78 < 111)
print(80 < 800)
print(1808 < 2000)
print(10100 < 18291121)
print(12345 < 1901090)

print(90 >= 90)
print(78 >= 10)
print(68 >= 68)
print(120 >= 110)
print(130 >= 130)

print(99 <= 100)
print(121 <= 121)
print(55 <= 55)
print(90 <= 99)
print(110 <= 112)


#and ოპერატორი მკაცრად ამოწმებს კოდს და თუ ერთი მაინც არის არასწორედ დაწერილი,False-ს წერს ტერმინალში.
#or ოპერატორი ამოწმებს კოდს და თუ ერთი მაინც არის სწორედ დაწერილი,True-ს წერს ტერმინალში.

print(16 > 17 and 18 > 19)
print(190 > 123 and 89 > 80)
print(130 >= 130 and 89 >= 90)

print(117 == 117 or 130 > 131)
print(140 < 139 or 90 == 21)
print(67 > 62 or 78 == 78)

number = 56
print(number >= 90)

name = "Levani"
print(name == "Levani" and 89 == 89)

age = 12
print( age == 18)