# String/str- მონაცემთა ტიპი რომელიც მოიცავს ყველაფერს რაც ზის ბრჭყალებში---> "home"/"thing"/...
# Integer/int - არის ყველა მთელი რიცხვი +უსასრულობიდან - უსასრულებამდე ---> 4355/5665656565...
# float - ყველა ათწილადი ---> 5.4/9.6...


# print() ფუნქციას ვიყენებთ ტერინალში რაღაცის დასაბეჭდად.სიტყვა,რაც გვინდა რომ ფუნქციამ დაბეჭდოს უნდა ჩავწეროთ ფრჩხილებში ---> print(happy birthday)


print("levan bedoshvili")
print(12)

# ცვლადებს ვიყენებთ მონაცემთაა შესანახად

name = "Levani"
surname = "Bedoshvili"
print(name)
print(surname)